Revit 2026 API

# AreaLoadSetLoops Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool SetLoops(
	Document doc,
	IList<CurveLoop> newLoops
)
```
```vb
Public Function SetLoops (
	doc As Document,
	newLoops As IList(Of CurveLoop)
) As Boolean
```
```cpp
public:
bool SetLoops(
	Document^ doc,
	IList<CurveLoop^>^ newLoops
)
```
```fsharp
member SetLoops :
        doc : Document *
        newLoops : IList<CurveLoop> -> bool
```

#### Parameters

doc Document

newLoops IListCurveLoop

#### Return Value

Boolean

#### Reference

AreaLoad Class

Autodesk.Revit.DB.Structure Namespace